# DataFrame

In [1]:
import pandas as pd

In [5]:
a=[34,2,6,4,7,3,8,33]
var=pd.DataFrame(a)
var

    0
0  34
1   2
2   6
3   4
4   7
5   3
6   8
7  33

In [6]:
print(type(var))

<class 'pandas.core.frame.DataFrame'>

In [7]:
b={"a":[2,4,67,2,56],"b":[2,3,2,5,3]}
var1=pd.DataFrame(b)
var1

    a  b
0   2  2
1   4  3
2  67  2
3   2  5
4  56  3

In [8]:
print(type(var1))

<class 'pandas.core.frame.DataFrame'>

In [13]:
c={"a":[2,4,67,2,56],"b":[2,3,454,5,3],"c":[2,4,73,79,3],100:[362,21,345,2,5]}
var2=pd.DataFrame(c,columns=["c",100])
var2

    c  100
0   2  362
1   4   21
2  73  345
3  79    2
4   3    5

In [15]:
var2=pd.DataFrame(c,index=["A","B","C","D","E"])
var2

    a    b   c  100
A   2    2   2  362
B   4    3   4   21
C  67  454  73  345
D   2    5  79    2
E  56    3   3    5

In [16]:
print(var2["b"]["C"])

454

In [17]:
list_1= [[2,4,1,5,68],[34,2,42,4,2]]
var3=pd.DataFrame(list_1)
var3

    0  1   2  3   4
0   2  4   1  5  68
1  34  2  42  4   2

In [ ]:
sr = {"S":pd.Series([2,4,1,5,68]),"R":pd.Series([34,2,42,4,2])